rails/blog/app/controllers/articulos_controller.rb

	def index
		@articulos = Articulo.all
---
SELECT "articulos".* FROM "articulos"

	def show
		@articulo = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@articulo = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@articulo = Articulo.new(articulo_params)

		if @articulo.save
---
INSERT INTO "articulos" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Este es mi Blog"], ["text", "algún dia estara lleno"], ["created_at", "2018-06-23 13:56:33.699227"], ["updated_at", "2018-06-23 13:56:33.699227"]]

	def update
		@articulo= Articulo.find(params[:id])

		if @articulo.update(articulo_params)
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articulos" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articulos"."id" = ?  [["title", "Este es un titulo"], ["text", "y aqui va el contenido"], ["updated_at", "2018-06-23 13:51:04.302507"], ["id", 1]]

	def destroy
		@articulo = Articulo.find(params[:id])
		@articulo.destroy
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articulos" WHERE "articulos"."id" = ?  [["id", 1]]